package BaseCode._02类的成分和定义类;
/**
    目标：类的成分和定义类。

    类是描述一类事物的，那么类中可以定义哪些成分呢 ?
        类中有且仅有五大成分（5大金刚）:
        类的定义格式：
            修饰符 class 类名{
                 1.成员变量（Field,描述类或者对象的属性信息的，姓名，年龄，身高，体重）
                 2.成员方法（Method ,描述类或者对象的行为的，吃饭，睡觉，买票，....）
                 3.构造器 （Constructor ,用来得到一个类的对象，帮助初始化类的对象的）
                 4.内部类
                 5.代码块
            }

    类的定义注意事项：
        1.一个Java代码中可以定义多个类。
        2.但是只能有一个类用public修饰。
        3.public修饰的类的类名必须成为Java代码文件的名称。
        4.实际开发中不建议大家再一个Java代码中定义多个类，不规范！
        5.类名的首字母应该大写，还必须满足驼峰模式，不能是关键字，必须是合法标识符。
 */
public class ClassDemo01 {
}

// 动物类
class Animal{

}