package code._06API文档的使用;

/**
    目标：API文档的使用。

    API:应用程序接口，其实就是sun公司已经写好的技术类和方法完成特定功能
       的使用说明书。
       API(开发文档，里面都是类，方法，构造器等的介绍):
       API-Guides(开发指南，里面就是文章，技术的使用和具体讲解)

    API详细使用介绍:
       实际上的使用流程（建议流程）：
             如果自己已经会就直接开发。键盘输入的功能。
             a.问同事 , 百度 。
             b.确定这个技术的代码。
             c.把代码直接拷贝，运行一下，运气好就对了，运气不好继续修修改改跑跑研究。

       理论上流程：(已经知道大体代码了！已经会了，来查看确认或者拓展一些功能)
         1. 打开帮助文档。
         2. 点击显示，找到索引，看到输入框。
         3. 你要找谁？在输入框里输入，然后回车。
         4. 看包。java.lang下的类不需要导包，默认导入的，其他包必须先导入才可以使用。
         5. 看类的解释和说明，就是看这个类的功能。
         6. 看这个类的方法功能，然后看这个方法是静态方法还是实例方法。
         7. 静态方法直接用类名访问。实例方法转看构造器。
         8. 看类的构造器，创建对象，来调用实例方法完成功能！

 */
public class APIDemo {
    public static void main(String[] args) {
    }
}
