package basecode._01集合概述;
/**
     目标：能够说出集合和数组的区别

     讲解：
         1. 什么是集合(回顾)
             一个用来存储多个数据的容器

         2. 集合和数组的区别
             数组：长度固定，可以存储基本数据类型和引用数据类型的数据
             集合：长度可变，只能存储引用数据类型的数据，如果要存储基本数据类型要使用对应的包装类类型。

         3. 集合的分类
             单列集合：一次只能存储一个元素
             双列集合：每次存储元素需要存储两个元素

     小结：
         1. 集合和数组的区别
             数组：长度固定，可以存储基本数据类型和引用数据类型的数据
             集合：长度可变，只能存储引用数据类型的数据，如果要存储基本数据类型要使用对应的包装类类型。
 */
public class Demo01 {

    public static void main(String[] args) {



    }

}
