package code.Base01.Base03;
/**
 目标：数据类型研究。

 变量的格式：
 数据类型 变量名称 = 初始值;

 数据类型有哪些？
 Java把数据类型设计成2大类：基本数据类型 ， 引用数据类型。
 1.基本数据类型：分为4大类8种。
 a.整型                    内存空间          类型数据范围
 byte  字节型          1个字节           -128~127     = 256个数据！！
 short 短整型          2个字节           -32768~32767
 int   整型（默认）    4个字节           -2147483648~2147483647
 long  长整型		  8个字节           很大
 b.浮点型(小数)
 float 单精度          4个字节
 double 双精度 （默认）8个字节
 c.布尔型
 boolean
 d.字符型
 char

 2.引用数据类型（后面学习）
 数组，类，接口，字符串类型String,等不是基本数据类型就是引用数据类型。
 小结：
 记住8种基本数据类型。
 开发时候直接用int定义整形，默认的
 开发的时候直接用double定义小数，默认的
 */
public class DataType{
    public static void main(String[] args){

    }
}
