package code.Base01;
/**
 目标：容器和数组的概念。

 容器：可以放置一批数据的对象。
     容器中的每个数据称为一个元素。
     数据 == 元素。

 什么是数组？
     数组是一个容器。
     数组是可以放置一批特定类型的元素。
     数组定义出来，数组的长度就确定了。数组的长度指的是数组存储元素的最大个数。

 为什么要用数组?
     开发中经常遇到数据是一批的，而且是类型是一样的。
         比如：一个班级的考试成绩。全部用户的名称。
             如果用变量的存储操作的话我们需要定义很多变量。
             所以涉及到一批特定类型的数据应该用数组来操作，更加优雅，操作管理更加合适。
 数组的注意事项：
     什么类型的数组只能存放什么类型的数据。
     所以在定义数组的时候，必须确定数组的元素类型，和数组的最终长度。
 小结：
     数组是一个容器。
     数组可以存储一批特定类型的元素。
     什么类型的数组只能存放什么类型的数据。
     定义数组的时候，必须确定数组的元素类型，和数组的最终长度。

 */
public class ArrayDemo01 {
}
