package basecode._11线程和进程概念;

/**
    目标：能够说出进程和线程的概念

    讲解：
        1. 什么是进程
            正在运行中的程序
            作用：用来封装线程，为线程执行任务提供资源：内存资源

        2. 什么是线程
            线程是进程中独立的执行单元
            线程是程序中的一个独立的执行路径
            作用：用来执行代码(执行任务)

        3. 进程和线程比喻
            进程：比喻工厂
            线程：比喻工人

    小结：
        1. 什么是进程
            一个正在运行中的程序
        2. 什么是线程
            进程中的独立执行单元
            
 */
public class Demo11 {
    public static void main(String[] args){
        System.out.println("aaa");
    }
}
