package BaseCode._01面向对象思想概述;
/**
    目标：面向对象思想概述。

    什么是面向对象思想？
         面向对象是一种程序设计思想、面向对象是用代码高度模拟现实世界。
         面向对象的代码很像人类的自然语言，代码看起来很简单。 zhubajie.eat("西瓜");
         面向对象的语言中最重要的两个概念是：类和对象。
         面向对象就是通过类和对象去描述万千事物的。

    什么是类?
         类是相同事物共同特征的描述。
         人类(属性：名字，年龄，身高，行为：吃饭，睡觉)。
         例如：学生类，人类，办公设备类，电子设备类。
         类的特点：类不是具体存在的，类只是学术用语上的一个概念，帮助人类认知的。
         类只能描述一类事物，并不能代表真实存在的具体事物。

    什么是对象?
         对象是类的具体实例。 对象==实例。
         对象是有类衍生出来的，在Java中，必须先有类，才能有对象。
         例子：李仁是学生类的对象（实例）。
              迪丽热巴是明星类的对象。
              lucky是狗的对象。
         桌子是类还是对象? 是类，这个桌子是对象了。

    有了类和对象就可以描述所有的具体事物。
    类只需要一个，对象可以有千千万万个。
    类是描述一类事物，而对象可以代表具体存在的所有具体事物。

    小结：
        面向对象的思想：用代码去高度模拟现实世界的事物。
        类和对象就可以描述所有的具体事物。


 */
public class ClassDemo {
}
